app/controllers/short_urls_controller.rb

  def index
    @test = ShortUrl.all
---
SELECT `short_urls`.* FROM `short_urls`

  def create
    #short_url = ShortUrl.new(full_url: params[:full_url], title: "")
    short_url = ShortUrl.new(short_url_params)
    puts short_url

    if short_url.save
---
INSERT INTO `short_urls` (`full_url`, `title`, `created_at`, `updated_at`) VALUES ('https://google.com', 'a', '2022-10-29 03:15:23.780327', '2022-10-29 03:15:23.780327')